export interface TypeName<T> {
  type: T;
  name: string;
}

export enum MealType {
  BREAKFAST = 'BREAKFAST',
  LUNCH = 'LUNCH',
  DINNER = 'DINNER'
}

export enum FoodType {
  VEGETARIAN = 'VEGETARIAN',
  VEGAN = 'VEGAN'
}

const FOOD_TYPE_DEF: Record<FoodType, string> = {
  [FoodType.VEGETARIAN]: 'вегетеріанська',
  [FoodType.VEGAN]: 'веганська'
};

export enum CookingComplexity {
  EASY = 'EASY',
  MEDIUM = 'MEDIUM',
  HARD = 'HARD'
}

export interface RecipeBase {
  id: string;
  name: string;
  mealType: MealType;
  foodType?: TypeName<FoodType>;
  cookingTime: number;
  cookingComplexity: CookingComplexity;
  imgUrl: string;
}

export interface RecipeFull extends RecipeBase {
  comment: string;
  numberOfServings: number;
  calories: number;
  ingredients: string[];
  preparationSteps: string[];
}

const MEAL_TYPES: TypeName<MealType>[] = [
  {
    type: MealType.BREAKFAST,
    name: 'Сніданок'
  },
  {
    type: MealType.LUNCH,
    name: 'Обід'
  },
  {
    type: MealType.DINNER,
    name: 'Вечеря'
  }
];

const RECIPES: RecipeFull[] = [
  // BREAKFAST
  {
    id: '1',
    name: 'Шпинатні млинці з авокадо',
    imgUrl: `${process.env.PUBLIC_URL}/images/recipes/img_1.png`,
    mealType: MealType.BREAKFAST,
    foodType: {
      type: FoodType.VEGETARIAN,
      name: FOOD_TYPE_DEF[FoodType.VEGETARIAN]
    },
    cookingTime: 25,
    cookingComplexity: CookingComplexity.EASY,
    comment: 'Барвисті, корисні млинці так само добре підходять на вечерю, як і на бранч у вихідні.',
    numberOfServings: 6,
    calories: 332,
    ingredients: [
      '1 стиглий авокадо',
      '350 г помідорів черрі',
      '100г шпинату',
      'зеленої цибулі',
      '1/2 пучка свіжого коріандру (15г)',
      '1 лайм',
      'оливкова олія першого віджиму',
      '1 велике яйце',
      '1 стакан борошна',
      '1 стакан напівзнежиреного молока',
      '300г творожного сиру (можна на свій смак обрати любий)',
      'гострий соус чилі'
    ],
    preparationSteps: [
      'Авокадо розріжте навпіл, очистіть від шкірки і дрібно наріжте четвертинками помідори, а потім покладіть в салатницю разом з чвертю шпинату',
      'Дрібно наріжте і додайте зелену цибулю та листя коріандру, потім вичавіть сік лайма',
      'Полийте 1 столовою ложкою оливкової олії першого віджиму, приправте до досконалості морською сіллю і чорним перцем, відкладіть',
      'Розбийте яйце в блендер, додайте борошно, молоко, шпинат, що залишився, дрібку солі і перцю, потім збийте до однорідності',
      'Поставте велику антипригарну сковороду на середній вогонь, натріть сковороду невеликою кількістю оливкової олії, а потім налийте тонкий шар тіста, покрутивши його по краях. Готуйте з одного боку лише 2 хвилини або до легкого золотистого кольору, потім викладіть на тарілку і повторіть',
      'Посипте кожен млинець шматочками сиру, салатом з авокадо і кількома каплями соусу чилі. Дійсно гарно подається з додатковими шматочками лайма для віджимання та смаженим яйцем зверху, якщо вам подобається'
    ]
  },
  {
    id: '2',
    name: 'Сальса верде запечені яйця',
    imgUrl: `${process.env.PUBLIC_URL}/images/recipes/img_2.png`,
    mealType: MealType.BREAKFAST,
    foodType: {
      type: FoodType.VEGETARIAN,
      name: FOOD_TYPE_DEF[FoodType.VEGETARIAN]
    },
    cookingTime: 20,
    cookingComplexity: CookingComplexity.EASY,
    comment: 'Вмочіть лепешки в ці запечені яйця, щоб насолодитися чудовим соком.',
    numberOfServings: 4,
    calories: 268,
    ingredients: [
      '5 столових ложок оливкової олії',
      '1 ч. л. копченої паприки',
      '1 ч. л. насіння кмину',
      '400г банка помідорів черрі',
      '200г свіжих помідорів черрі',
      '2 зубчики часнику',
      '1 невеликий пучок петрушки',
      '1 маленький пучок базиліка',
      `1/2 невеликого пучка м'яти, зірвані листя`,
      '2 столові ложки каперсів',
      '1 чайна ложка діжонської гірчиці',
      '2 столові ложки білого винного оцту',
      '200г шпинату, промитого',
      '4 яйця',
      '1/2 чайної ложки пластівців чилі (за бажанням)',
      'лепешки для подачі (за бажанням)'
    ],
    preparationSteps: [
      'Влийте 1 столову ложку оливкової олії в сковороду або сотейник і обсмажте паприку і кмин протягом 30 секунд на середньому вогні. Додайте консервовані помідори і свіжі помідори, доведіть до кипіння, потім тушкуйте під кришкою на середньому вогні 5-6 хвилин, поки помідори не розм’якнуть',
      'Тим часом покладіть часник, більшу частину петрушки, базилік, м’яту, каперси, гірчицю, білий винний оцет, 4 столові ложки олії і 3 столові ложки холодної води в міні-кухонний комбайн і збийте до однорідної маси',
      'Перемішайте шпинат в сковороду з помідорами до повного зів’янення (знову закрийте кришку на кілька хвилин, а потім знову перемішайте, щоб він зів’яв). Зробіть чотири ямки в суміші і обережно розбийте в кожну яйце. Накрийте кришкою і готуйте на середньому вогні 6-8 хвилин або поки яйця не затвердіють. Відкрийте сковороду, а потім полийте трав’яним соусом. Розсипте зарезервовані пластівці петрушки та чилі, якщо використовуєте. Подавайте з коржами, якщо хочете'
    ]
  },
  {
    id: '3',
    name: 'Каша з бананом і корицею',
    imgUrl: `${process.env.PUBLIC_URL}/images/recipes/img_3.png`,
    mealType: MealType.BREAKFAST,
    foodType: {
      type: FoodType.VEGETARIAN,
      name: FOOD_TYPE_DEF[FoodType.VEGETARIAN]
    },
    cookingTime: 15,
    cookingComplexity: CookingComplexity.MEDIUM,
    comment: 'Каша — хороший основний сніданок; він дешевий, ситний і поживний, а також його надзвичайно просто готувати',
    numberOfServings: 4,
    calories: 315,
    ingredients: [
      '160г вівсянки',
      '600мл молока або органічного соєвого молока',
      '2 стиглих банана',
      '30г подрібненого мигдалю',
      '1/2 чайної ложки меленої кориці',
      '2 столові ложки маку',
      'кленовий сироп або рідкий мед'
    ],
    preparationSteps: [
      'Для каші помістіть овес і молоко (або 600 мл води) у велику каструлю на середньому вогні та додайте дрібну щіпку морської солі',
      'Доведіть до постійного кип’ятіння протягом 5-6 хвилин, часто помішуючи, щоб отримати гладку вершкову кашу і якщо потрібно, додайте додаткове молоко',
      'Очистіть і наріжте банани під кутом',
      'Обсмажте мигдаль на сухій антипригарній сковороді на середньому вогні протягом 3-4 хвилин або до легкого золотистого кольору',
      'Додайте в  кашу корицю, мак і трохи кленового сиропу або меду (перемішайте), а потім розділіть між мисками',
      'Зверху розсипте банани і мигдаль, а потім полийте невеликою кількістю кленового сиропу або меду, якщо хочете'
    ]
  },

  // LUNCH
  {
    id: '4',
    name: 'Фахітас з куркою',
    imgUrl: `${process.env.PUBLIC_URL}/images/recipes/img_4.png`,
    mealType: MealType.LUNCH,
    cookingTime: 150,
    cookingComplexity: CookingComplexity.MEDIUM,
    comment:
      'Ми можемо подякувати кухні Tex-Mex за класичну фахіту. Спочатку цей термін означав смужку м’яса на грилі, що подається в коржику. У наші дні ви можете знайти стейк, курку, креветки або навіть вегетаріанські фахітас',
    numberOfServings: 4,
    calories: 179,
    ingredients: [
      '1/2 склянки, плюс 1ст. ложка оливкової олії',
      '1/4 склянка соку лайма, приблизно з 3 лаймів',
      '2 ч.л. кмину',
      '1/2 ч.л. подрібненого червоного перцю',
      '1кг курячої грудки без кісток та без шкіри',
      'Сіль',
      'Чорний свіжозмелений перець',
      '2шт. болгарського перцю, тонко нарізаного',
      '1 велика цибулина, тонко нарізана'
    ],
    preparationSteps: [
      'У великій мисці змішайте 1⁄2 склянки олії, сік лайма, кмин і болгарський перець. Приправте курку сіллю і перцем, потім додайте в миску і перемішайте. Залиште маринуватися в холодильнику мінімум на 30 хвилин і до 2 годин',
      'Коли будете готові готувати, розігрійте решту столової ложки олії у великій сковороді на середньому вогні. Додайте курку і готуйте до золотистого кольору і готовності, по 8 хвилин з кожної сторони. Дайте відпочити 10 хвилин, потім наріжте смужками',
      'Додайте болгарський перець і цибулю в сковороду і готуйте до м’якості, 5 хвилин. Додайте курку і перемішайте до з’єднання. '
    ]
  },
  {
    id: '5',
    name: 'Часникові спагетті',
    imgUrl: `${process.env.PUBLIC_URL}/images/recipes/img_5.png`,
    mealType: MealType.LUNCH,
    foodType: {
      type: FoodType.VEGETARIAN,
      name: FOOD_TYPE_DEF[FoodType.VEGETARIAN]
    },
    cookingTime: 45,
    cookingComplexity: CookingComplexity.EASY,
    comment: 'Анчоуси в цьому рецепті зовсім необов’язкові. Часник, однак, ні!',
    numberOfServings: 4,
    calories: 210,
    ingredients: [
      'Сіль',
      '1 упаковка спагетті',
      '4 ст.л. оливкової олії',
      '6 зубчики часнику, 3 подрібнених і 3 нарізаних, розділені',
      '1/2 склянка хлібних крихтів',
      '1/4 ч.л. подрібненого червоного перцю',
      '1 ст.л. вершкового масла',
      '2 банки анчоусів в маслі, подрібнені (за бажанням)',
      'Цедра і сік 1/2 лимона',
      'Пучок свіжої нарізаної петрушки'
    ],
    preparationSteps: [
      'У великій каструлі з киплячою підсоленою водою варіть макарони до стану аль денте відповідно до інструкцій на упаковці',
      'Тим часом у великій сковороді на середньому вогні розігрійте 3 столові ложки олії. Додайте подрібнений часник і панірувальні сухарі, приправте пластівцями червоного перцю і сіллю. Готуйте, поки хлібні крихти не стануть золотистими, а часник не стане ароматним, приблизно 3 хвилини. Перекладіть хлібні крихти на тарілку, застелену паперовим рушником, і протріть сковороду',
      'Поверніть сковороду на середній вогонь і додайте решту 1 столової ложки олії та вершкового масла. Коли масло розтопиться, додайте нарізаний часник і анчоуси, якщо використовуєте. Готуйте, поки часник не стане ароматним, а анчоуси не розчиняться, приблизно 2 хвилини',
      'Додайте макарони в сковороду і перемішайте до з’єднання. Змішайте лимонну цедру і сік. І 1/2 склянки води для макаронів і перемішайте, додаючи більше, якщо потрібно, щоб соус загустив. Додайте петрушку і три чверті хлібних крихт і перемішайте до з’єднання',
      'Перед подачею посипте панірувальними сухарями, що залишилися'
    ]
  },
  {
    id: '6',
    name: 'Брюссельська капуста на грилі',
    imgUrl: `${process.env.PUBLIC_URL}/images/recipes/img_6.png`,
    mealType: MealType.LUNCH,
    foodType: {
      type: FoodType.VEGAN,
      name: FOOD_TYPE_DEF[FoodType.VEGAN]
    },
    cookingTime: 45,
    cookingComplexity: CookingComplexity.EASY,
    comment: 'Якщо ви думали, що брюссельська капуста не може бути смачною, зачекайте, поки ви приготуєте її на грилі',
    numberOfServings: 6,
    calories: 110,
    ingredients: [
      '1кг брюссельської капусти, розрізанох навпіл',
      '3 ст.л. оливкової олії',
      '2 ст.л. бальзамічного оценту',
      '1 ст.л. меду',
      'Сіль',
      '1 ст.л. зернистої гірчиці',
      '1/4 ч.л. подрібненого червоного перцю',
      '1/2 склянки тертого пармезана для прикраси'
    ],
    preparationSteps: [
      'Розігрійте гриль. У великій мисці змішайте брюссельську капусту, оливкову олію, оцет, мед, гірчицю і пластівці червоного перцю і приправте сіллю',
      'Обережно нанизайте капусту на шпажки. Обсмажуйте на грилі, часто перевертаючи, поки паростки не стануть м’якими і не приготуються, приблизно від 10 до 15 хвилин. Перед подачею прикрасьте пармезаном'
    ]
  },

  // DINNER
  {
    id: '7',
    name: 'Салат нісуаз з лосося ',
    imgUrl: `${process.env.PUBLIC_URL}/images/recipes/img_7.png`,
    mealType: MealType.DINNER,
    foodType: {
      type: FoodType.VEGETARIAN,
      name: FOOD_TYPE_DEF[FoodType.VEGETARIAN]
    },
    cookingTime: 25,
    cookingComplexity: CookingComplexity.MEDIUM,
    comment: 'З звареними яйцями та йогуртовою заправкою',
    numberOfServings: 2,
    calories: 398,
    ingredients: [
      '2x120г філе лосося без кісток з шкіркою',
      '300г стручкової квасолі',
      '2 великих яйця',
      '8 чорних оливок',
      '2 столові ложки грецького йогурту з горкою'
    ],
    preparationSteps: [
      'Помістіть лосося шкірою вниз на шумівку над каструлю з киплячою підсоленою водою, накривши кришкою, готувати на пару протягом 8 хвилин',
      'Обріжте лише кінець плодоніжки у бобів, потім відваріть у воді під лососем протягом 6 хвилин або до готовності. Зваріть окремо яйця, готувуючи рівно 5 хвилин',
      'Тим часом оливки дрібно наріжте . Змішайте половину оливок з йогуртом та крапелькою червоного винного оцту, спробуйте і приправте до досконалості морською сіллю та чорним перцем',
      'Вийміть лосося на дошку, боби на шумівку',
      'Помістіть квасолю в заправку і розділіть між своїми тарілками. Освіжіть яйця під холодною водою, поки вони не охолонуть, а потім почистіть і наріжте четвертинками',
      'Поверху розкладіть лосося знявши шкірку, додайте зверху яйця та  нарізані оливки',
      'Завершіть приготування 1 чайною ложкою оливкової олії та дрібкою перцю'
    ]
  },
  {
    id: '8',
    name: 'Супер зелені спагетті',
    imgUrl: `${process.env.PUBLIC_URL}/images/recipes/img_8.png`,
    mealType: MealType.DINNER,
    foodType: {
      type: FoodType.VEGETARIAN,
      name: FOOD_TYPE_DEF[FoodType.VEGETARIAN]
    },
    cookingTime: 13,
    cookingComplexity: CookingComplexity.MEDIUM,
    comment: 'Заміти тосканську капусту можна листями шпината',
    numberOfServings: 2,
    calories: 456,
    ingredients: ['150г спагетті', '4 зубчики часнику', '200г тосканська капуста', '30г сиру пармезан', '30г сиру Рікотта'],
    preparationSteps: [
      'Відваріть макарони в каструлі з киплячою підсоленою водою згідно з інструкцією на упаковці',
      'Тим часом почистіть часник. Вирвіть стебла з капусти і вкиньте, додавши листя і часник у сковороду',
      'Налийте 1½ столової ложки оливкової олії першого віджиму в блендер, потім дрібно натріть на тертці пармезан та додайте його також в блендер',
      'Використовуйте щипці, щоб обережно перекласти листя капусти та часник прямо в блендер і збити кілька хвилин до надзвичайно гладкої консистенції. Спробуйте та приправте до досконалості морською сіллю та чорним перцем',
      'Злийте воду з макаронів та додайте соус, а потім розділіть між своїми тарілками',
      'Посипте рікотту , збризніть трохи оливкової олії першого віджиму та смакуйте'
    ]
  },
  {
    id: '9',
    name: 'Найкращий веганський бургер',
    imgUrl: `${process.env.PUBLIC_URL}/images/recipes/img_9.png`,
    mealType: MealType.DINNER,
    foodType: {
      type: FoodType.VEGAN,
      name: FOOD_TYPE_DEF[FoodType.VEGAN]
    },
    cookingTime: 50,
    cookingComplexity: CookingComplexity.MEDIUM,
    comment: 'Ці веганські кукурудзяні гамбургери, наповнені смаком, корисні та приносять задоволення.',
    numberOfServings: 4,
    calories: 417,
    ingredients: [
      '1х400г банки нуту',
      '1х340г банки солодкох кукурудзи',
      '1/2 пучка свіжого коріандру (15г)',
      '1/2 чайної ложки паприки',
      '1/2 чайної ложки меленого коріандру',
      '1/2 чайної ложки меленого кмину',
      '1 лимон',
      '3 столові ложки простого борошна з горкою',
      'Оливкова олія',
      '4 маленьких листа салату',
      '2 великих стиглих помідора',
      'томатний кетчуп',
      '4 цільнозернових булочки для гамбургерів'
    ],
    preparationSteps: [
      'Злийте нут і кукурудзу, а потім перекиньте в кухонний комбайн, додавши половину листя коріандру',
      'Додайте спеції, борошно і дрібку морської солі, дрібно натріть лимонну цедру, потім перемеліть до з’єднання, але не однорідного, щоб зберегти трохи текстури',
      'На присипаній борошном поверхні розділіть суміш і сформуйте 4 однакові за розміром котлетки товщиною приблизно 2 см. Поставити в холодильник на 30 хвилин для застигання',
      'Розігрійте трохи олії у великій сковороді на середньому вогні, додайте котлети і готуйте 10 хвилин або до золотистого кольору і готовності, перевернувши на іншу половину',
      'Тим часом промийте та обсушіть чотири красивих листя салату, а потім  наріжте помідори горизонтально',
      'Видавіть велику ложку кетчупу на основу кожної булочки (підсмажте їх, якщо хочете), а потім викладіть котлети. Викладіть шаром пару скибочок помідорів, лист салату, кілька листків коріандру і верхівки бургера. Смачно подається зі свіжим зеленим салатом'
    ]
  }
];

export const getMealTypes = (): Promise<TypeName<MealType>[]> => Promise.resolve(MEAL_TYPES);

export const getRecipes = (recipesMealType?: MealType): Promise<RecipeFull[]> => {
  const recipes = recipesMealType ? RECIPES.filter(({ mealType }) => mealType === recipesMealType) : RECIPES;
  return Promise.resolve(recipes);
};

export const getRecipeById = (recipeId: string): Promise<RecipeFull> => {
  const recipe = RECIPES.find(({ id }) => id === recipeId)!;
  return Promise.resolve(recipe);
};
