import React from 'react';
import './HealthyFood.scss';
import DynamicHeader from '../../components/layout/DynamicHeader';
import { useNavigate } from 'react-router-dom';

function HealthyFood() {
  const navigate = useNavigate();

  return (
    <div>
      <div className="mb-52 position-sticky">
        <DynamicHeader title={'Правильне харчування'} />
      </div>
      <section className="mx-24 mt-12 mb-72">
        <p>
          <span className="font-weight-400 font-size-xxl line-height-xxl">
            Здорове <br /> харчування
          </span>
          <span className="font-weight-300">
            &nbsp;&nbsp;(здорова дієта, англ. healthy diet) — це харчування, яке забезпечує ріст, нормальний розвиток і життєдіяльність людини, що
            сприяє зміцненню її здоров'я та профілактиці захворювань. Дотримання правил здорового харчування в поєднанні з регулярними
            фізичними вправами, скорочує ризик хронічних захворювань і розладів, таких як ожиріння, серцево-судинні захворювання, діабет,
            підвищений тиск і рак.
          </span>
        </p>
      </section>
      <section className="mb-72 w-100">
        <img className="w-100" src={`${process.env.PUBLIC_URL}/images/healthy-food/healthy-food-title.png`} />
      </section>
      <section className="background-light-brown mb-72 py-40 px-24">
        <div className="font-weight-300">
          <p className="mb-20">
            &nbsp;&nbsp;<span className="font-weight-400 font-size-md">Здорова дієта</span> — це не суворі обмеження, нереально худий чи
            позбавлення себе їжі, яку ви любите. Швидше, йдеться про те, щоб почувати себе чудово, мати більше енергії, покращити своє
            здоров’я та підняти настрій.
          </p>

          <p>
            &nbsp;&nbsp;Здорове харчування не повинно бути занадто складним. Якщо ви відчуваєте себе перевантаженими всіма суперечливими порадами
            щодо харчування та дієти, то ви не самотні. Здається, що для кожного експерта, який стверджує, що певна їжа корисна для вас, ви
            знайдете іншого, який стверджує прямо протилежне. Правда полягає в тому, що хоча деякі конкретні продукти або поживні речовини
            мають сприятливий вплив на настрій, найважливішим є ваш загальний режим харчування. Наріжним каменем здорового харчування має
            бути заміна обробленої їжі справжньою, коли це можливо. Вживання їжі, яка максимально наближена до того, як її створила природа,
            може мати величезні зміни в тому, як ви думаєте, виглядаєте і відчуваєте.
          </p>
        </div>
      </section>
      <section className="mb-72">
        <img src={`${process.env.PUBLIC_URL}/images/healthy-food/pears.png`} />
      </section>
      <section className="px-24 mb-72">
        <div className="bordered-title mb-20">Основи здорового харчування</div>

        <p className="mb-20 font-weight-300">
          &nbsp;&nbsp;Хоча деякі екстремальні дієти можуть говорити про інше, всім нам потрібен баланс білків, жирів, вуглеводів, клітковини,
          вітамінів і мінералів у нашому раціоні, щоб підтримувати здорове тіло. Вам не потрібно вилучати певні категорії їжі зі свого
          раціону, а краще вибрати найбільш здорові варіанти з кожної категорії.
        </p>

        <p className="mb-20 font-weight-300">
          &nbsp;&nbsp;<span className="font-weight-400 font-size-md font-style-italic">Білок</span> дає вам енергію, щоб вставати й йти — і
          продовжувати — а також підтримує настрій та когнітивні функції. Занадто багато білка може бути шкідливим для людей із
          захворюваннями нирок, але останні дослідження показують, що багатьом з нас потрібно більше високоякісного білка, особливо з віком.
          Це не означає, що ви повинні їсти більше тваринних продуктів — різноманітні рослинні джерела білка щодня можуть забезпечити ваше
          тіло одержанням всього необхідного білка, який йому необхідний.
        </p>

        <p className="mb-20 font-weight-300">
          &nbsp;&nbsp;<span className="font-weight-400 font-size-md font-style-italic">Жир</span> Не всі жири однакові. У той час як погані жири
          можуть зіпсувати ваш раціон і підвищити ризик деяких захворювань, хороші жири захищають ваш мозок і серце. Насправді здорові жири,
          такі як омега-3, життєво важливі для вашого фізичного та емоційного здоров’я. Додавання більшої кількості корисних жирів у свій
          раціон може допомогти покращити настрій, покращити самопочуття та навіть підрізати талію.
        </p>

        <p className="mb-20 font-weight-300">
          &nbsp;&nbsp;<span className="font-weight-400 font-size-md font-style-italic">Клітковина</span> Вживання продуктів з високим вмістом
          харчових волокон (зернові, фрукти, овочі, горіхи та боби) може допомогти вам залишатися регулярним і знизити ризик серцевих
          захворювань, інсульту та діабету. Це також може покращити вашу шкіру і навіть допомогти вам схуднути.
        </p>

        <p className="mb-20 font-weight-300">
          &nbsp;&nbsp;<span className="font-weight-400 font-size-md font-style-italic">Кальцій</span> Окрім остеопорозу, недостатня кількість
          кальцію у вашому раціоні також може спричинити тривогу, депресію та проблеми зі сном. Незалежно від вашого віку чи статі, важливо
          включити у свій раціон продукти, багаті кальцієм, обмежити продукти, які виснажують кальцій, і отримувати достатню кількість
          магнію та вітамінів D і K, щоб допомогти кальцію виконувати свою роботу.
        </p>

        <p className="font-weight-300">
          &nbsp;&nbsp;<span className="font-weight-400 font-size-md font-style-italic">Вуглеводи</span> є одним з основних джерел енергії вашого
          організму. Але більшість має надходити зі складних, нерафінованих вуглеводів (овочі, цільні зерна, фрукти), а не з цукру та
          рафінованих вуглеводів. Зменшення споживання білого хліба, випічки, крохмалю та цукру може запобігти швидким стрибкам цукру в
          крові, коливанням настрою та енергії, а також накопиченню жиру, особливо навколо талії.
        </p>
      </section>

      <section className="p-24 background-light-brown mb-72">
        <div className="d-flex justify-end align-center mb-44">
          <span className="font-weight-500 font-size-md">Перехід на здорове харчування</span>
          <img className="ml-10" src={`${process.env.PUBLIC_URL}/icons/step.svg`} />
        </div>

        <p className="font-weight-300 mb-40">Перехід на здорове харчування не повинен бути пропозицією «все або нічого».</p>

        <button className="btn" onClick={() => navigate('/healthy-food/step')}>
          Більше
        </button>
      </section>

      <section className="px-24 mb-96">
        <div className="bordered-title mb-12"> 10 правил харчування </div>
        <p className="font-weight-300 mb-20">
          Використовуючи ці прості поради, ви можете подолати плутанину і навчитися створювати, і дотримуватися смачну, різноманітну та
          поживну дієту, яка так само корисна для вашого розуму, як і для тіла.
        </p>

        <div className="mb-20">
          <div className="font-size-md font-style-italic">&nbsp;&nbsp;1. Завантажте тарілку овочами</div>
          <p className="font-weight-300">
            Навіть Міністерство сільського господарства США відмовилося від заплутаної харчової піраміди на користь простішої діаграми
            «здорової тарілки» . Щоб створити здорову тарілку, заповніть половину тарілки овочами — і ні, картопля фрі не в рахунок!
            Вибирайте «хрусткі» овочі, такі як брокколі, зелена квасоля, брюссельська капуста та листові зелені, такі як капуста і мангольд.
            З іншого боку тарілки в одну четвертинку покладіть цільні зерна або бобові, а в іншу порцію здорового пісного білка.
          </p>
        </div>

        <div className="mb-20">
          <div className="font-weight-400 font-size-md font-style-italic">&nbsp;&nbsp;2. Їжте збалансований сніданок</div>
          <p className="font-weight-300">
            Навіть Міністерство сільського господарства США відмовилося від заплутаної харчової піраміди на користь простішої діаграми
            «здорової тарілки» . Щоб створити здорову тарілку, заповніть половину тарілки овочами — і ні, картопля фрі не в рахунок!
            Вибирайте «хрусткі» овочі, такі як брокколі, зелена квасоля, брюссельська капуста та листові зелені, такі як капуста і мангольд.
            З іншого боку тарілки в одну четвертинку покладіть цільні зерна або бобові, а в іншу порцію здорового пісного білка.
          </p>
        </div>

        <div className="mb-20">
          <div className="font-weight-400 font-size-md font-style-italic">&nbsp;&nbsp;3. Не моріть себе голодом</div>
          <p className="font-weight-300">
            Ця стратегія не тільки шкідлива для здоров’я — вона майже завжди має зворотний ефект. Якщо ви не споживаєте достатньо калорій
            протягом дня, ви, швидше за все, переїдете вночі. Коли ви весь день зосереджуєтесь на тому, щоб скупитися на їжу, ви
            налаштовуєтеся на переїдання пізніше. І замість того, щоб сісти за здоровий вечір, ви, швидше за все, винагородите себе за те,
            що ви були таким «хорошим» цілий день, потягнувшись за калорійною бомбою, як-от пінту морозива або шматка торта.
          </p>
        </div>

        <div className="mb-20">
          <div className="font-weight-400 font-size-md font-style-italic">&nbsp;&nbsp;4. Обмежте споживання натрію та цукру</div>
          <p className="font-weight-300">
            <span className="mb-20">
              Відкласти сільничку та пропустити цукор у каві — це крок у правильному напрямку, але більшість людей отримує більшість солі та
              цукру не там. Натрій і цукор поширені в більшості упакованих продуктів: від соусу для макаронів і макаронів і сиру до рисових
              сумішей і супів. Почніть з перевірки поживної цінності на вашій пластівці для сніданку (у деяких упаковках до 20 грамів цукру
              на порцію!).
            </span>
            <br />
            Ось коротка порада: поділіть кількість цукру в грамах на 4, і ви отримаєте кількість чайних ложок. Ви б дійсно насипали 5 чайних
            ложок цукру в свою миску для каш?
          </p>
        </div>

        <div className="mb-20">
          <div className="font-weight-400 font-size-md font-style-italic">&nbsp;&nbsp;5. Не просто рахуйте калорії</div>
          <p className="font-weight-300">
            Не всі калорії створені однаковими. Люди їдять ті 100-калорійні пачки печива чи інших закусок і зосереджуються на тому, що це
            лише 100 калорій, але вони не звертають уваги на те, що ще вони отримують, особливо з точки зору цукру та жиру. Кращий підхід:
            зосередьтеся на здорових продуктах, багатих поживними речовинами , які від природи мають низький вміст калорій і багаті
            необхідними вітамінами, мінералами та клітковиною.
          </p>
        </div>

        <div className="mb-20">
          <div className="font-weight-400 font-size-md font-style-italic">&nbsp;&nbsp;6. Перейдіть на цільнозернові</div>
          <p className="font-weight-300">
            Що стосується вуглеводів, то коричневий краще. Цільнозернові продукти (наприклад, цільна пшениця, коричневий рис і вівсянка)
            містять більше поживних речовин і клітковини, ніж їх оброблені білі родичі. Ці складні вуглеводи не тільки корисніші для вас
            (більше споживання клітковини пов’язано зі зниженням ризику діабету та серцево-судинних захворювань), але вони також допомагають
            довше залишатися ситими. Тому замість того, щоб уникати вуглеводів, щоб схуднути, почніть із заміни білих на цільнозернові.
          </p>
        </div>

        <div className="mb-20">
          <div className="font-weight-400 font-size-md font-style-italic">&nbsp;&nbsp;7. Насолоджуйтесь їжею</div>
          <p className="font-weight-300">
            Це може здатися очевидним, але багато людей думають, що здорове харчування та задоволення взаємовиключні. Уявіть, що ви ніколи
            не чули слова «дієта». Натомість працюйте над способом життя, побудованим на основі здорового вибору, який спрацює в
            довгостроковій перспективі. Щоб досягти цієї мети, знайдіть поживні продукти, які вам подобається. Їжа має бути тим, що вам
            подобається і що вас живить. Це не просто паливо.
          </p>
        </div>

        <div className="mb-20">
          <div className="font-weight-400 font-size-md font-style-italic">&nbsp;&nbsp;8.Їжте якісну їжу</div>
          <p className="font-weight-300">
            Має значення не тільки тип їжі, яку ви кладете в рот, але й її якість. Було показано, що вживання в їжу сезонних місцевих
            інгредієнтів має більшу поживну цінність. Хіба ви не хотіли б, щоб продукція була зібрана на піку за кілька днів до того, як ви
            її купите, замість того, щоб витягувати її на кілька тижнів раніше, щоб вона не зіпсувалася, коли їздите тижнями по країні? Та
            мені теж.
          </p>
        </div>

        <div className="mb-20">
          <div className="font-weight-400 font-size-md font-style-italic">&nbsp;&nbsp;9.Уникайте рафінованих вуглеводів</div>
          <p className="font-weight-300">
            Отже, є хороші вуглеводи і не дуже. Правда полягає в тому, що не всі вуглеводи створені однаковими. До категорії не дуже гарних
            вуглеводів належать ваші рафіновані білі продукти, такі як хліб, борошно, макарони та чіпси. Проблема цих вуглеводів полягає в
            тому, що вони позбавлені зовнішнього зерна, де корисні речовини, як клітковина та білок. Коли це усувається, харчування також
            виходить за межі дверей, залишаючи у вас порожні калорії.
          </p>
        </div>

        <div className="mb-20">
          <div className="font-weight-400 font-size-md font-style-italic">
            &nbsp;&nbsp;10. Їжте менше солі: не більше 6 г на день для дорослих
          </div>
          <p className="font-weight-300">
            Занадто багато солі може підвищити кров’яний тиск. Люди з високим кров’яним тиском частіше захворюють серцевими захворюваннями
            або переносять інсульт. Навіть якщо ви не додаєте сіль у їжу, ви все одно їсте занадто багато. Приблизно три чверті солі, яку ви
            споживаєте, вже міститься в їжі, коли ви її купуєте, як-от сухі сніданки, супи, хліб і соуси.
          </p>
        </div>
      </section>
    </div>
  );
}

export default HealthyFood;
