import React from 'react';
import './StepToHealthyFood.scss';
import DynamicHeader from '../../components/layout/DynamicHeader';

function StepToHealthyFood() {
  return (
    <div>
      <div className="mb-52">
        <DynamicHeader navigateUrl="/healthy-food" title={'Правильне харчування'} />
      </div>

      <section className="background-light-brown px-24 py-40 mb-72">
        <div className="d-flex justify-end mb-10">
          <span className="font-weight-500 font-size-md">Перехід на здорове харчування</span>
          <img src={`${process.env.PUBLIC_URL}/icons/step.svg`} />
        </div>

        <div className="font-weight-300">
          <p className="mb-20">
            &nbsp;Перехід на здорове харчування не повинен бути пропозицією «все або нічого». Ви не повинні бути ідеальними, вам не потрібно
            повністю вилучати продукти, які вам подобаються, і вам не потрібно змінювати все відразу — це зазвичай призводить лише до обману
            або відмови від вашого нового плану харчування.
          </p>
          <p>
            &nbsp;Кращий підхід — вносити кілька невеликих змін за раз. Збереження своїх цілей скромними може допомогти вам досягти більшого
            в довгостроковій перспективі, не відчуваючи обділу або перевантаження через серйозну зміну дієти. Подумайте про планування
            здорового харчування як про низку невеликих, керованих кроків, наприклад, додавання салату до свого раціону раз на день. Коли
            ваші невеликі зміни стануть звичкою, ви можете продовжувати додавати більше здорових варіантів.
          </p>
        </div>
      </section>

      <section className="d-flex justify-end mb-72">
        <img src={`${process.env.PUBLIC_URL}/images/healthy-food/coconut.png`} />
      </section>

      <section className="px-24 pb-28 mb-72">
        <div className="bordered-title mb-20">Налаштуйте себе на успіх</div>

        <p className="font-weight-300 mb-20">
          &nbsp;Щоб налаштувати себе на успіх, намагайтеся бути простими. Здорове харчування не повинно бути складним. Наприклад, замість
          того, щоб надмірно турбуватися про підрахунок калорій, подумайте про свій раціон з точки зору кольору, різноманітності та
          свіжості. Зосередьтеся на тому, щоб уникати упакованих і оброблених харчових продуктів і вибирати більше свіжих інгредієнтів, коли
          це можливо.
        </p>

        <div className="font-size-md font-weight-400 font-style-italic mb-8">Готуйте більше власних страв</div>

        <p className="font-weight-300 mb-20">
          &nbsp;Приготування більшої кількості їжі вдома може допомогти вам контролювати те, що ви їсте, і краще контролювати, що саме
          входить до вашої їжі. Ви споживатимете менше калорій і уникаєте хімічних добавок, доданого цукру та шкідливих жирів у упакованих
          продуктах і продуктах на винос, які можуть викликати у вас відчуття втоми, роздутості та дратівливості, а також посилити симптоми
          депресії, стресу та тривоги.
        </p>

        <div className="font-size-md font-weight-400 font-style-italic mb-8">Внесіть правильні зміни </div>

        <p className="font-weight-300 mb-20">
          &nbsp;При скороченні шкідливих продуктів у своєму раціоні важливо замінити їх здоровими альтернативами. Заміна небезпечних
          транс-жирів здоровими жирами (наприклад, заміна смаженої курки на лосося на грилі) позитивно впливає на ваше здоров’я. Проте
          заміна тваринних жирів на рафіновані вуглеводи (наприклад, заміна бекону для сніданку на пончики) не знизить ризик серцевих
          захворювань і не покращить настрій.
        </p>

        <div className="font-size-md font-weight-400 font-style-italic mb-8">Пийте багато води</div>

        <p className="font-weight-300 mb-20">
          &nbsp;Вода допомагає очистити нашу систему від відходів і токсинів, але багато хто з нас переживає життя зневодненими, що викликає
          втому, низьку енергію та головні болі. Зазвичай спрагу сприймають за голод, тому регулярне зволоження також допоможе вам зробити
          вибір більш здорової їжі.
        </p>
      </section>

      <section className="mb-72">
        <img src={`${process.env.PUBLIC_URL}/images/healthy-food/avocado.png`} />
      </section>

      <section className="px-24 pb-28 mb-72">
        <div className="bordered-title mb-20">Помірність</div>

        <p className="font-weight-300 mb-20">
          Що таке помірність? По суті, це означає їсти стільки їжі, скільки потрібно вашому організму. Ви повинні відчувати задоволення в
          кінці трапези, але не насичені. Для багатьох із нас помірність означає їсти менше, ніж зараз. Але це не означає виключити
          продукти, які ви любите. Наприклад, вживання бекону на сніданок раз на тиждень можна вважати помірним, якщо ви доповнюєте його
          здоровим обідом і вечерею, але не якщо ви додаєте до нього коробку пончиків і піцу з ковбасою.
        </p>

        <div className="font-size-md font-weight-400 font-style-italic mb-8">Намагайтеся не сприймати певні продукти як «заборонені»</div>

        <p className="font-weight-300 mb-20">
          Коли ви забороняєте певні продукти, природно хотіти цих продуктів більше, а потім відчувати себе невдачею, якщо піддастеся
          спокусі. Почніть зі зменшення розміру порцій шкідливих продуктів і не їсти їх так часто. Коли ви зменшуєте споживання нездорової
          їжі, ви можете помітити, що ви відчуваєте бажання її менше або думати про неї як про випадкові поблажливості.
        </p>

        <div className="font-size-md font-weight-400 font-style-italic mb-8">Думайте про менші порції</div>

        <p className="font-weight-300 mb-20">
          Під час обіду вибирайте закуску замість основного, розділіть блюдо з другом і не замовляйте нічого великого. У домашніх умовах
          візуальні підказки можуть допомогти з розміром порцій. Ваша порція м’яса, риби чи курки має бути розміром з колоду карт, а
          півсклянки картопляного пюре, рису чи макаронів – приблизно з традиційну лампочку. Подаючи їжу на менших тарілках або в мисках, ви
          можете обманом змусити свій мозок подумати, що це більша порція. Якщо ви не відчуваєте задоволення в кінці їжі, додайте більше
          листової зелені або доповніть їжу фруктами.
        </p>

        <div className="font-size-md font-weight-400 font-style-italic mb-8">Не поспішайте</div>

        <p className="font-weight-300 mb-20">
          Важливо сповільнитися і думати про їжу як про поживу, а не про щось, що можна ковтнути між зустрічами або по дорозі, щоб забрати
          дітей. Насправді вашому мозку потрібно кілька хвилин, щоб повідомити вашому тілу, що йому достатньо їжі, тому їжте повільно і
          припиніть їсти, перш ніж відчуєте ситість.
        </p>

        <div className="font-size-md font-weight-400 font-style-italic mb-8">Уникайте їжі пізно ввечері</div>

        <p className="font-weight-300 mb-20">
          Намагайтеся вечеряти раніше і швидко протягом 14-16 годин до сніданку наступного ранку. Дослідження показують, що їжа лише тоді,
          коли ви найбільш активні, і щодня даючи своїй травній системі тривалу перерву, може допомогти регулювати вагу.
        </p>
      </section>

      <section className="px-24 mb-72">
        <div className="bordered-title mb-20">Додайте більше фруктів і овочів</div>

        <p className="font-weight-300 mb-12">
          &nbsp;Фрукти та овочі мають низьку калорійність і вміст поживних речовин, а це означає, що вони насичені вітамінами, мінералами,
          антиоксидантами та клітковиною. Зосередьтеся на щоденному споживанні принаймні п’яти порцій фруктів і овочів, і це, природно,
          наситить вас і допоможе скоротити споживання нездорової їжі. Порція — це півсклянки сирих фруктів або овочів, наприклад, невелике
          яблуко чи банан. Більшості з нас потрібно подвоїти кількість, яку ми споживаємо зараз.
        </p>

        <div className="font-size-md font-weight-400 mb-12">Щоб збільшити споживання:</div>

        <ul className="font-weight-300">
          <li>1. Додайте багаті антиоксидантами ягоди до ваших улюблених сухих сніданків</li>

          <li>2. З’їжте суміш солодких фруктів — апельсинів, манго, ананаса, винограду — на десерт</li>
          <li>3. Замініть свій звичайний гарнір з рису або макаронів на барвистий салат</li>
          <li>
            4. Замість того, щоб їсти оброблені закуски, перекусіть овочами, такими як морква, горошок або помідори черрі, разом з гострим
            соусом з хумусу або арахісовим маслом
          </li>
        </ul>
      </section>
    </div>
  );
}

export default StepToHealthyFood;
