export interface TitleDescription {
  title: string;
  description: string;
}

export const getTopicsInfo = (): Promise<TitleDescription[]> => {
  return Promise.resolve([
    {
      title: 'Правильне харчування',
      description:
        'Здорове харчування — це не тільки хороше самопочуття і позбавлення від багатьох недуг, міцна нервова система і нормалізація маси тіла, але й любов та повага до себе, це прагнення до здорового і тривалого життя. Вживання різноманітних продуктів, які дають усі поживні речовини, необхідні для підтримання здоров’я. До цих речовин належить білок, вуглеводи, жири, вода, вітаміни та мінерали.'
    },
    {
      title: 'Цілісна рослинна дієта',
      description:
        'Дотримання дієти на основі рослинної їжі відрізняється від дотримання веганської дієти. Хоча жодна з них не включає продукти тваринного походження або продукти, отримані з інгредієнтів тваринного походження, дієта на основі рослинної їжі на основі рослин йде на крок далі і не включає надмірно оброблені продукти, такі як олія, нездорову їжу , біле борошно, білий цукор або будь-яку іншу оброблювану їжу.'
    },
    {
      title: 'Вегатеріанство та веганство',
      description:
        "Інтерес до вегетаріанського типу харчування зростає з кожним роком. У великих містах постійно з'являються нові ресторани вегетаріанців, на прилавках магазинів все частіше можна зустріти спеціалізовані продукти для вегетаріанців: рослинне молоко, соєве м'ясо, десерти без молока і яєць.\n" +
        'Розберемося, які варіанти вегетаріанства бувають залежно від рівня обмеження тваринної їжі.'
    }
  ]);
};
